In [7]:
import pandas as pd
import numpy as np

In [11]:
a = [1,2,3,4,5,6,'mustafa' , 'qasim ali']
print(a)
print(type(a))

[1, 2, 3, 4, 5, 6, 'mustafa', 'qasim ali']
<class 'list'>

In [12]:
a = np.array([1,2,3,4,5,6,'mustafa' , 'qasim ali'])
print(a)
print(type(a))

['1' '2' '3' '4' '5' '6' 'mustafa' 'qasim ali']
<class 'numpy.ndarray'>

In [13]:
a = pd.Series([1,2,3,4,5,6,'mustafa' , 'qasim ali']) #every value has given index
print(a)
print(type(a))

0            1
1            2
2            3
3            4
4            5
5            6
6      mustafa
7    qasim ali
dtype: object
<class 'pandas.core.series.Series'>

In [15]:
a = pd.Series([1,2,3,4,5,6,'mustafa' , 'qasim ali'],index = ['a','b','c','d','e','f','g','h'])
print(a)
print(type(a))

a            1
b            2
c            3
d            4
e            5
f            6
g      mustafa
h    qasim ali
dtype: object
<class 'pandas.core.series.Series'>

In [18]:
a = pd.Series([1,2,3,4,5,6,'mustafa' , 'qasim ali'],index =[x for x in "abcdefgh"])
print(a)
print(type(a))

a            1
b            2
c            3
d            4
e            5
f            6
g      mustafa
h    qasim ali
dtype: object
<class 'pandas.core.series.Series'>

In [20]:
a = pd.Series([1,2,3,4,5,6,7],index = ['a','b','c','d','e','f','g'] , dtype = float)
print(a)
print(type(a))

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    6.0
g    7.0
dtype: float64
<class 'pandas.core.series.Series'>

In [21]:
a = pd.Series([1,2,3,4,5,6,7],index = ['a','b','c','d','e','f','g'] , dtype = float , name  =  'XYZ')
print(a)
print(type(a))

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    6.0
g    7.0
Name: XYZ, dtype: float64
<class 'pandas.core.series.Series'>

In [23]:
a = pd.Series(5.2,index = ['a','b','c','d','e','f','g']) #same value will given to all index
print(a)
print(type(a))

a    5.2
b    5.2
c    5.2
d    5.2
e    5.2
f    5.2
g    5.2
dtype: float64
<class 'pandas.core.series.Series'>

In [25]:
s1 = pd.Series({"a":"mustafa" , "b":"AIDS" , "c":"CSE"})
print(s1)
print(type(s1))

a    mustafa
b       AIDS
c        CSE
dtype: object
<class 'pandas.core.series.Series'>

In [30]:
a = pd.Series([1,2,3,4,5,6,7],index = ['a','b','c','d','e','f','g'],dtype = float)
print(a)
print(type(a))

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
f    6.0
g    7.0
dtype: float64
<class 'pandas.core.series.Series'>

# Indexing and Slicing

In [31]:
print(a['d'])

4.0

In [32]:
print(a['f'])

6.0

In [33]:
print(a['c':'f'])

c    3.0
d    4.0
e    5.0
f    6.0
dtype: float64

# Max and Min

In [34]:
max(a)

7.0

In [35]:
min(a)

1.0

# opeartion on series

In [40]:
s1 = pd.Series([1,2,3,4,5,6,7])
s2 = pd.Series([11,12,13,14,15,16,17])
print(s1)
print(s2)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64
0    11
1    12
2    13
3    14
4    15
5    16
6    17
dtype: int64

In [41]:
print(s1+s2) #adding the two series

0    12
1    14
2    16
3    18
4    20
5    22
6    24
dtype: int64

In [42]:
print(s1-s2)

0   -10
1   -10
2   -10
3   -10
4   -10
5   -10
6   -10
dtype: int64

# Dataframe

In [45]:
data1 = pd.DataFrame([1,2,3,4,5,6])
data2 = pd.Series([1,2,3,4,5,6])
print("this is dataframe:")
print(data1)
print("this is series:")
print(data2)

this is dataframe:
   0
0  1
1  2
2  3
3  4
4  5
5  6
this is series:
0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [56]:
arr = np.arange(1,101).reshape(10,10)
arr = pd.DataFrame(arr)
arr

    0   1   2   3   4   5   6   7   8    9
0   1   2   3   4   5   6   7   8   9   10
1  11  12  13  14  15  16  17  18  19   20
2  21  22  23  24  25  26  27  28  29   30
3  31  32  33  34  35  36  37  38  39   40
4  41  42  43  44  45  46  47  48  49   50
5  51  52  53  54  55  56  57  58  59   60
6  61  62  63  64  65  66  67  68  69   70
7  71  72  73  74  75  76  77  78  79   80
8  81  82  83  84  85  86  87  88  89   90
9  91  92  93  94  95  96  97  98  99  100

In [59]:
data3 =pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
data3

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [61]:
data3 =pd.DataFrame([{'Id1':[1,2,3],'Id2':[4,5,6],'Id3':[7,8,9]}])
data3

         Id1        Id2        Id3
0  [1, 2, 3]  [4, 5, 6]  [7, 8, 9]

In [63]:
data3 =pd.DataFrame({'id':[1,2,3,4],'id2':[11,12,13,14]})
data3

   id  id2
0   1   11
1   2   12
2   3   13
3   4   14

In [68]:
arr = np.linspace(1,3,25 , dtype = int).reshape(5,5)
arr = pd.DataFrame(arr)
arr

   0  1  2  3  4
0  1  1  1  1  1
1  1  1  1  1  1
2  1  1  2  2  2
3  2  2  2  2  2
4  2  2  2  2  3

In [75]:
arr = pd.DataFrame(np.linspace(1,3,25 , dtype = int).reshape(5,5) , columns = ["Id1","Id2","Id3","Id4","Id5"])
arr

   Id1  Id2  Id3  Id4  Id5
0    1    1    1    1    1
1    1    1    1    1    1
2    1    1    2    2    2
3    2    2    2    2    2
4    2    2    2    2    3

In [89]:
data1 = pd.DataFrame({'Roll No':np.arange(101,109) ,'Name': np.array(["mustafa" , "Ali","Krishnpal","Pankaj","Ankush","Monu","Shyam","Nikhlesh"]) , 'Per':np.array([45,65,78,90,23,45,67,90])})
data1

   Roll No       Name  Per
0      101    mustafa   45
1      102        Ali   65
2      103  Krishnpal   78
3      104     Pankaj   90
4      105     Ankush   23
5      106       Monu   45
6      107      Shyam   67
7      108   Nikhlesh   90

In [90]:
data2 = pd.DataFrame({'Grade':["c+","B+","A","A+","D","C+","B","A+"]})
data2

  Grade
0    c+
1    B+
2     A
3    A+
4     D
5    C+
6     B
7    A+

In [93]:
data1["Grade"] = data2
data1

   Roll No       Name  Per Grade   4
0      101    mustafa   45    c+  c+
1      102        Ali   65    B+  B+
2      103  Krishnpal   78     A   A
3      104     Pankaj   90    A+  A+
4      105     Ankush   23     D   D
5      106       Monu   45    C+  C+
6      107      Shyam   67     B   B
7      108   Nikhlesh   90    A+  A+

In [92]:
data1[4] = data2 #alternative method
data1

   Roll No       Name  Per Grade   4
0      101    mustafa   45    c+  c+
1      102        Ali   65    B+  B+
2      103  Krishnpal   78     A   A
3      104     Pankaj   90    A+  A+
4      105     Ankush   23     D   D
5      106       Monu   45    C+  C+
6      107      Shyam   67     B   B
7      108   Nikhlesh   90    A+  A+